zephyrproject-rtos/zephyr/ext/hal/nordic/nrfx/mdk/nrf52811.svd
<?xml version="1.0" encoding="utf-8"?>
<!-- File naming: <vendor>_<part/series name>_svd.xml -->
<device schemaVersion="1.1" xmlns:xs="http://www.w3.org/2001/XMLSchema-instance" noNamespaceSchemaLocation="CMSIS-SVD.xsd">
  <vendor>Nordic Semiconductor</vendor>
  <vendorID>Nordic</vendorID>
  <name>nrf52811</name>
  <series>nrf52</series>
  <version>1</version>
  <description>nRF52811 reference description for radio MCU with ARM 32-bit Cortex-M4 Microcontroller </description>
  <licenseText>
Copyright (c) 2010 - 2018, Nordic Semiconductor ASA All rights reserved.\n
\n
Redistribution and use in source and binary forms, with or without\n
modification, are permitted provided that the following conditions are met:\n
\n
1. Redistributions of source code must retain the above copyright notice, this\n
   list of conditions and the following disclaimer.\n
\n
2. Redistributions in binary form must reproduce the above copyright\n
   notice, this list of conditions and the following disclaimer in the\n
   documentation and/or other materials provided with the distribution.\n
\n
3. Neither the name of Nordic Semiconductor ASA nor the names of its\n
   contributors may be used to endorse or promote products derived from this\n
   software without specific prior written permission.\n
\n
THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"\n
AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE\n
IMPLIED WARRANTIES OF MERCHANTABILITY, AND FITNESS FOR A PARTICULAR PURPOSE\n
ARE DISCLAIMED. IN NO EVENT SHALL NORDIC SEMICONDUCTOR ASA OR CONTRIBUTORS BE\n
LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR\n
CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF\n
SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS\n
INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN\n
CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)\n
ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE\n
POSSIBILITY OF SUCH DAMAGE.\n
        </licenseText>
  <addressUnitBits>8</addressUnitBits>
  <width>32</width>
  <size>32</size>
  <resetValue>0x00000000</resetValue>
  <resetMask>0xFFFFFFFF</resetMask>
  <cpu>
    <name>CM4</name>
    <revision>r0p1</revision>
    <endian>little</endian>
    <mpuPresent>1</mpuPresent>
    <fpuPresent>0</fpuPresent>
    <nvicPrioBits>3</nvicPrioBits>
    <vendorSystickConfig>0</vendorSystickConfig>
  </cpu>
  <headerSystemFilename>system_nrf52811</headerSystemFilename>
  <headerDefinitionsPrefix>NRF_</headerDefinitionsPrefix>
  <vendorExtensions>
    <ExampleStackSize>2048</ExampleStackSize>
    <ExampleHeapSize>2048</ExampleHeapSize>
    <MaxInterrupts>112</MaxInterrupts>
  </vendorExtensions>
  <peripherals>
    <peripheral>
      <name>FICR</name>
      <description>Factory information configuration registers</description>
      <baseAddress>0x10000000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x1000</size>
        <usage>registers</usage>
      </addressBlock>
      <groupName>FICR</groupName>
      <size>0x20</size>
      <registers>
        <register>
          <name>CODEPAGESIZE</name>
          <description>Code memory page size</description>
          <addressOffset>0x010</addressOffset>
          <access>read-only</access>
          <resetValue>0x00001000</resetValue>
          <fields>
            <field>
              <name>CODEPAGESIZE</name>
              <description>Code memory page size</description>
              <lsb>0</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>CODESIZE</name>
          <description>Code memory size</description>
          <addressOffset>0x014</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000030</resetValue>
          <fields>
            <field>
              <name>CODESIZE</name>
              <description>Code memory size in number of pages</description>
              <lsb>0</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <dim>0x2</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>DEVICEID[%s]</name>
          <description>Description collection: Device identifier</description>
          <addressOffset>0x060</addressOffset>
          <access>read-only</access>
          <resetValue>0xFFFFFFFF</resetValue>
          <fields>
            <field>
              <name>DEVICEID</name>
              <description>64 bit unique device identifier</description>
              <lsb>0</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <dim>0x4</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>ER[%s]</name>
          <description>Description collection: Encryption root, word n</description>
          <addressOffset>0x080</addressOffset>
          <access>read-only</access>
          <resetValue>0xFFFFFFFF</resetValue>
          <fields>
            <field>
              <name>ER</name>
              <description>Encryption root, word n</description>
              <lsb>0</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <dim>0x4</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>IR[%s]</name>
          <description>Description collection: Identity root, word n</description>
          <addressOffset>0x090</addressOffset>
          <access>read-only</access>
          <resetValue>0xFFFFFFFF</resetValue>
          <fields>
            <field>
              <name>IR</name>
              <description>Identity root, word n</description>
              <lsb>0</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>DEVICEADDRTYPE</name>
          <description>Device address type</description>
          <addressOffset>0x0A0</addressOffset>
          <access>read-only</access>
          <resetValue>0xFFFFFFFF</resetValue>
          <fields>
            <field>
              <name>DEVICEADDRTYPE</name>
              <description>Device address type</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Public</name>
                  <description>Public address</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Random</name>
                  <description>Random address</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <dim>0x2</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>DEVICEADDR[%s]</name>
          <description>Description collection: Device address n</description>
          <addressOffset>0x0A4</addressOffset>
          <access>read-only</access>
          <resetValue>0xFFFFFFFF</resetValue>
          <fields>
            <field>
              <name>DEVICEADDR</name>
              <description>48 bit device address</description>
              <lsb>0</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <cluster>
          <name>INFO</name>
          <description>Device info</description>
          <headerStructName>FICR_INFO</headerStructName>
          <access>read-only</access>
          <addressOffset>0x100</addressOffset>
          <register>
            <name>PART</name>
            <description>Part code</description>
            <addressOffset>0x000</addressOffset>
            <access>read-only</access>
            <resetValue>0x00052811</resetValue>
            <fields>
              <field>
                <name>PART</name>
                <description>Part code</description>
                <lsb>0</lsb>
                <msb>31</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>N52810</name>
                    <description>nRF52810</description>
                    <value>0x52810</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>N52811</name>
                    <description>nRF52811</description>
                    <value>0x52811</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Unspecified</name>
                    <description>Unspecified</description>
                    <value>0xFFFFFFFF</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>VARIANT</name>
            <description>Part variant, hardware version and production configuration</description>
            <addressOffset>0x004</addressOffset>
            <access>read-only</access>
            <resetValue>0xFFFFFFFF</resetValue>
            <fields>
              <field>
                <name>VARIANT</name>
                <description>Part variant, hardware version and production configuration, encoded as ASCII</description>
                <lsb>0</lsb>
                <msb>31</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>AAAA</name>
                    <description>AAAA</description>
                    <value>0x41414141</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>AAA0</name>
                    <description>AAA0</description>
                    <value>0x41414130</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>AABA</name>
                    <description>AABA</description>
                    <value>0x41414241</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>AABB</name>
                    <description>AABB</description>
                    <value>0x41414242</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>AAB0</name>
                    <description>AAB0</description>
                    <value>0x41414230</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>AACA</name>
                    <description>AACA</description>
                    <value>0x41414341</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>AACB</name>
                    <description>AACB</description>
                    <value>0x41414342</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>AAC0</name>
                    <description>AAC0</description>
                    <value>0x41414330</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Unspecified</name>
                    <description>Unspecified</description>
                    <value>0xFFFFFFFF</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>PACKAGE</name>
            <description>Package option</description>
            <addressOffset>0x008</addressOffset>
            <access>read-only</access>
            <resetValue>0xFFFFFFFF</resetValue>
            <fields>
              <field>
                <name>PACKAGE</name>
                <description>Package option</description>
                <lsb>0</lsb>
                <msb>31</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>QF</name>
                    <description>QFxx - 48-pin QFN</description>
                    <value>0x2000</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>QC</name>
                    <description>QCxx - 32-pin QFN</description>
                    <value>0x2003</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>CA</name>
                    <description>CAxx - WLCSP</description>
                    <value>0x2004</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Unspecified</name>
                    <description>Unspecified</description>
                    <value>0xFFFFFFFF</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>RAM</name>
            <description>RAM variant</description>
            <addressOffset>0x00C</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000018</resetValue>
            <fields>
              <field>
                <name>RAM</name>
                <description>RAM variant</description>
                <lsb>0</lsb>
                <msb>31</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>K24</name>
                    <description>24 kByte RAM</description>
                    <value>0x18</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Unspecified</name>
                    <description>Unspecified</description>
                    <value>0xFFFFFFFF</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>FLASH</name>
            <description>Flash variant</description>
            <addressOffset>0x010</addressOffset>
            <access>read-only</access>
            <resetValue>0x000000C0</resetValue>
            <fields>
              <field>
                <name>FLASH</name>
                <description>Flash variant</description>
                <lsb>0</lsb>
                <msb>31</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>K192</name>
                    <description>192 kByte flash</description>
                    <value>0xC0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Unspecified</name>
                    <description>Unspecified</description>
                    <value>0xFFFFFFFF</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
        </cluster>
        <cluster>
          <name>TEMP</name>
          <description>Registers storing factory TEMP module linearization coefficients</description>
          <headerStructName>FICR_TEMP</headerStructName>
          <access>read-only</access>
          <addressOffset>0x404</addressOffset>
          <register>
            <name>A0</name>
            <description>Slope definition A0</description>
            <addressOffset>0x000</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000320</resetValue>
            <fields>
              <field>
                <name>A</name>
                <description>A (slope definition) register</description>
                <lsb>0</lsb>
                <msb>11</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>A1</name>
            <description>Slope definition A1</description>
            <addressOffset>0x004</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000343</resetValue>
            <fields>
              <field>
                <name>A</name>
                <description>A (slope definition) register</description>
                <lsb>0</lsb>
                <msb>11</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>A2</name>
            <description>Slope definition A2</description>
            <addressOffset>0x008</addressOffset>
            <access>read-only</access>
            <resetValue>0x0000035D</resetValue>
            <fields>
              <field>
                <name>A</name>
                <description>A (slope definition) register</description>
                <lsb>0</lsb>
                <msb>11</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>A3</name>
            <description>Slope definition A3</description>
            <addressOffset>0x00C</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000400</resetValue>
            <fields>
              <field>
                <name>A</name>
                <description>A (slope definition) register</description>
                <lsb>0</lsb>
                <msb>11</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>A4</name>
            <description>Slope definition A4</description>
            <addressOffset>0x010</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000452</resetValue>
            <fields>
              <field>
                <name>A</name>
                <description>A (slope definition) register</description>
                <lsb>0</lsb>
                <msb>11</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>A5</name>
            <description>Slope definition A5</description>
            <addressOffset>0x014</addressOffset>
            <access>read-only</access>
            <resetValue>0x0000037B</resetValue>
            <fields>
              <field>
                <name>A</name>
                <description>A (slope definition) register</description>
                <lsb>0</lsb>
                <msb>11</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>B0</name>
            <description>Y-intercept B0</description>
            <addressOffset>0x018</addressOffset>
            <access>read-only</access>
            <resetValue>0x00003FCC</resetValue>
            <fields>
              <field>
                <name>B</name>
                <description>B (y-intercept)</description>
                <lsb>0</lsb>
                <msb>13</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>B1</name>
            <description>Y-intercept B1</description>
            <addressOffset>0x01C</addressOffset>
            <access>read-only</access>
            <resetValue>0x00003F98</resetValue>
            <fields>
              <field>
                <name>B</name>
                <description>B (y-intercept)</description>
                <lsb>0</lsb>
                <msb>13</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>B2</name>
            <description>Y-intercept B2</description>
            <addressOffset>0x020</addressOffset>
            <access>read-only</access>
            <resetValue>0x00003F98</resetValue>
            <fields>
              <field>
                <name>B</name>
                <description>B (y-intercept)</description>
                <lsb>0</lsb>
                <msb>13</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>B3</name>
            <description>Y-intercept B3</description>
            <addressOffset>0x024</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000012</resetValue>
            <fields>
              <field>
                <name>B</name>
                <description>B (y-intercept)</description>
                <lsb>0</lsb>
                <msb>13</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>B4</name>
            <description>Y-intercept B4</description>
            <addressOffset>0x028</addressOffset>
            <access>read-only</access>
            <resetValue>0x0000004D</resetValue>
            <fields>
              <field>
                <name>B</name>
                <description>B (y-intercept)</description>
                <lsb>0</lsb>
                <msb>13</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>B5</name>
            <description>Y-intercept B5</description>
            <addressOffset>0x02C</addressOffset>
            <access>read-only</access>
            <resetValue>0x00003E10</resetValue>
            <fields>
              <field>
                <name>B</name>
                <description>B (y-intercept)</description>
                <lsb>0</lsb>
                <msb>13</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>T0</name>
            <description>Segment end T0</description>
            <addressOffset>0x030</addressOffset>
            <access>read-only</access>
            <resetValue>0x000000E2</resetValue>
            <fields>
              <field>
                <name>T</name>
                <description>T (segment end) register</description>
                <lsb>0</lsb>
                <msb>7</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>T1</name>
            <description>Segment end T1</description>
            <addressOffset>0x034</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <fields>
              <field>
                <name>T</name>
                <description>T (segment end) register</description>
                <lsb>0</lsb>
                <msb>7</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>T2</name>
            <description>Segment end T2</description>
            <addressOffset>0x038</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000014</resetValue>
            <fields>
              <field>
                <name>T</name>
                <description>T (segment end) register</description>
                <lsb>0</lsb>
                <msb>7</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>T3</name>
            <description>Segment end T3</description>
            <addressOffset>0x03C</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000019</resetValue>
            <fields>
              <field>
                <name>T</name>
                <description>T (segment end) register</description>
                <lsb>0</lsb>
                <msb>7</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>T4</name>
            <description>Segment end T4</description>
            <addressOffset>0x040</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000050</resetValue>
            <fields>
              <field>
                <name>T</name>
                <description>T (segment end) register</description>
                <lsb>0</lsb>
                <msb>7</msb>
              </field>
            </fields>
          </register>
        </cluster>
