zephyrproject-rtos/zephyr/ext/hal/nordic/nrfx/mdk/nrf52811.svd
        <register>
          <name>MODECNF0</name>
          <description>Radio mode configuration register 0</description>
          <addressOffset>0x650</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000200</resetValue>
          <fields>
            <field>
              <name>RU</name>
              <description>Radio ramp-up time</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Default</name>
                  <description>Default ramp-up time (tRXEN and tTXEN), compatible with firmware written for nRF51</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Fast</name>
                  <description>Fast ramp-up (tRXEN,FAST and tTXEN,FAST), see electrical specification for more information</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DTX</name>
              <description>Default TX value</description>
              <lsb>8</lsb>
              <msb>9</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B1</name>
                  <description>Transmit '1'</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B0</name>
                  <description>Transmit '0'</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Center</name>
                  <description>Transmit center frequency</description>
                  <value>2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SFD</name>
          <description>IEEE 802.15.4 start of frame delimiter</description>
          <addressOffset>0x660</addressOffset>
          <access>read-write</access>
          <resetValue>0x000000A7</resetValue>
          <fields>
            <field>
              <name>SFD</name>
              <description>IEEE 802.15.4 start of frame delimiter</description>
              <lsb>0</lsb>
              <msb>7</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>EDCNT</name>
          <description>IEEE 802.15.4 energy detect loop count</description>
          <addressOffset>0x664</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>EDCNT</name>
              <description>IEEE 802.15.4 energy detect loop count</description>
              <lsb>0</lsb>
              <msb>20</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>EDSAMPLE</name>
          <description>IEEE 802.15.4 energy detect level</description>
          <addressOffset>0x668</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>EDLVL</name>
              <description>IEEE 802.15.4 energy detect level</description>
              <lsb>0</lsb>
              <msb>7</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>CCACTRL</name>
          <description>IEEE 802.15.4 clear channel assessment control</description>
          <addressOffset>0x66C</addressOffset>
          <access>read-write</access>
          <resetValue>0x052D0000</resetValue>
          <fields>
            <field>
              <name>CCAMODE</name>
              <description>CCA mode of operation</description>
              <lsb>0</lsb>
              <msb>2</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EdMode</name>
                  <description>Energy above threshold</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CarrierMode</name>
                  <description>Carrier seen</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CarrierAndEdMode</name>
                  <description>Energy above threshold AND carrier seen</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CarrierOrEdMode</name>
                  <description>Energy above threshold OR carrier seen</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EdModeTest1</name>
                  <description>Energy above threshold test mode that will abort when first ED measurement over threshold is seen. No averaging.</description>
                  <value>4</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CCAEDTHRES</name>
              <description>CCA energy busy threshold. Used in all the CCA modes except CarrierMode.</description>
              <lsb>8</lsb>
              <msb>15</msb>
            </field>
            <field>
              <name>CCACORRTHRES</name>
              <description>CCA correlator busy threshold. Only relevant to CarrierMode, CarrierAndEdMode and CarrierOrEdMode.</description>
              <lsb>16</lsb>
              <msb>23</msb>
            </field>
            <field>
              <name>CCACORRCNT</name>
              <description>Limit for occurances above CCACORRTHRES. When not equal to zero the corrolator based signal detect is enabled.</description>
              <lsb>24</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>DFEMODE</name>
          <description>Whether to use Angle-of-Arrival (AOA) or Angle-of-Departure (AOD)</description>
          <addressOffset>0x900</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DFEOPMODE</name>
              <description>Direction finding operation mode</description>
              <lsb>0</lsb>
              <msb>1</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Direction finding mode disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AoD</name>
                  <description>Direction finding mode set to AoD</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AoA</name>
                  <description>Direction finding mode set to AoA</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CTEINLINECONF</name>
          <description>Configuration for CTE inline mode</description>
          <addressOffset>0x904</addressOffset>
          <access>read-write</access>
          <resetValue>0x00002800</resetValue>
          <fields>
            <field>
              <name>CTEINLINECTRLEN</name>
              <description>Enable parsing of CTEInfo from received packet in BLE modes</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Parsing of CTEInfo is enabled</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Parsing of CTEInfo is disabled</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CTEINFOINS1</name>
              <description>CTEInfo is S1 byte or not</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>InS1</name>
                  <description>CTEInfo is in S1 byte (data PDU)</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NotInS1</name>
                  <description>CTEInfo is NOT in S1 byte (advertising PDU)</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CTEERRORHANDLING</name>
              <description>Sampling/switching if CRC is not OK</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Yes</name>
                  <description>Sampling and antenna switching also when CRC is not OK</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>No</name>
                  <description>No sampling and antenna switching when CRC is not OK</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CTETIMEVALIDRANGE</name>
              <description>Max range of CTETime</description>
              <lsb>6</lsb>
              <msb>7</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>20</name>
                  <description>20 in 8us unit (default) Set to 20 if parsed CTETime is larger han 20</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>31</name>
                  <description>31 in 8us unit</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>63</name>
                  <description>63 in 8us unit</description>
                  <value>2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CTEINLINERXMODE1US</name>
              <description>Spacing between samples for the samples in the SWITCHING period when CTEINLINEMODE is set</description>
              <lsb>10</lsb>
              <msb>12</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>4us</name>
                  <description>4us</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>2us</name>
                  <description>2us</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1us</name>
                  <description>1us</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>500ns</name>
                  <description>0.5us</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>250ns</name>
                  <description>0.25us</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>125ns</name>
                  <description>0.125us</description>
                  <value>6</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CTEINLINERXMODE2US</name>
              <description>Spacing between samples for the samples in the SWITCHING period when CTEINLINEMODE is set</description>
              <lsb>13</lsb>
              <msb>15</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>4us</name>
                  <description>4us</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>2us</name>
                  <description>2us</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1us</name>
                  <description>1us</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>500ns</name>
                  <description>0.5us</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>250ns</name>
                  <description>0.25us</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>125ns</name>
                  <description>0.125us</description>
                  <value>6</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>S0CONF</name>
              <description>S0 bit pattern to match</description>
              <lsb>16</lsb>
              <msb>23</msb>
            </field>
            <field>
              <name>S0MASK</name>
              <description>S0 bit mask to set which bit to match</description>
              <lsb>24</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>DFECTRL1</name>
          <description>Various configuration for Direction finding</description>
          <addressOffset>0x910</addressOffset>
          <access>read-write</access>
          <resetValue>0x00023282</resetValue>
          <fields>
            <field>
              <name>NUMBEROF8US</name>
              <description>Length of the AoA/AoD procedure in number of 8 us units</description>
              <lsb>0</lsb>
              <msb>5</msb>
            </field>
            <field>
              <name>DFEINEXTENSION</name>
              <description>Add CTE extension and do antenna switching/sampling in this extension</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CRC</name>
                  <description>AoA/AoD procedure triggered at end of CRC</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Payload</name>
                  <description>Antenna switching/sampling is done in the packet payload</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TSWITCHSPACING</name>
              <description>Interval between every time the antenna is changed in the SWITCHING state</description>
              <lsb>8</lsb>
              <msb>10</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>4us</name>
                  <description>4us</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>2us</name>
                  <description>2us</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1us</name>
                  <description>1us</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TSAMPLESPACINGREF</name>
              <description>Interval between samples in the REFERENCE period</description>
              <lsb>12</lsb>
              <msb>14</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>4us</name>
                  <description>4us</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>2us</name>
                  <description>2us</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1us</name>
                  <description>1us</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>500ns</name>
                  <description>0.5us</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>250ns</name>
                  <description>0.25us</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>125ns</name>
                  <description>0.125us</description>
                  <value>6</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SAMPLETYPE</name>
              <description>Whether to sample I/Q or magnitude/phase</description>
              <lsb>15</lsb>
              <msb>15</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>IQ</name>
                  <description>Complex samples in I and Q</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MagPhase</name>
                  <description>Complex samples as magnitude and phase</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TSAMPLESPACING</name>
              <description>Interval between samples in the SWITCHING period when CTEINLINECTRLEN is 0</description>
              <lsb>16</lsb>
              <msb>18</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>4us</name>
                  <description>4us</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>2us</name>
                  <description>2us</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1us</name>
                  <description>1us</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>500ns</name>
                  <description>0.5us</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>250ns</name>
                  <description>0.25us</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>125ns</name>
                  <description>0.125us</description>
                  <value>6</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>AGCBACKOFFGAIN</name>
              <description>Gain will be lowered by the specified number of gain steps at the start of CTE</description>
              <lsb>24</lsb>
              <msb>27</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>DFECTRL2</name>
          <description>Start offset for Direction finding</description>
          <addressOffset>0x914</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>TSWITCHOFFSET</name>
              <description>Signed value offset after the end of the CRC before starting switching in number of 16M cycles</description>
              <lsb>0</lsb>
              <msb>12</msb>
            </field>
            <field>
              <name>TSAMPLEOFFSET</name>
              <description>Signed value offset before starting sampling in number of 16M cycles relative to the beginning of the REFERENCE state - 12 us after switching start</description>
              <lsb>16</lsb>
              <msb>27</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>SWITCHPATTERN</name>
          <description>GPIO patterns to be used for each antenna</description>
          <addressOffset>0x928</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>SWITCHPATTERN</name>
              <description>Fill array of GPIO patterns for antenna control</description>
              <lsb>0</lsb>
              <msb>7</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>CLEARPATTERN</name>
          <description>Clear the GPIO pattern array for antenna control</description>
          <addressOffset>0x92C</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>CLEARPATTERN</name>
              <description>Clears GPIO pattern array for antenna control</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Clear</name>
                  <description>Writing a '1' clears the GPIO pattern; writing a '0' has no effect</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
